# Дан список чисел. Определите,
# сколько в нем встречается различных чисел. (речь об уникальных неповторяющихся числах)

list_nums = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
print(len(set(list_nums)))